---
title: "교과과정"
date: 2019-11-04T14:00:23-05:00
type: education
layout: single
weight: 3
banner: "img/banners/banner-1.jpg"
icon: "book"
---
학부과정과 대학원 과정에서 이수해야 할 과목들에 대한 소개와 졸업요건에 대한 안내입니다.
<!--more-->

<br>
<br>

## 학부과정
----------
#### (~18학번) 이수조건(단일전공 졸업기준, 일반편입생 동일 적용)
<br>
**필수교양**

	- 미분적분학과 벡터해석 (1),(2)
	- 일반물리학 및 실험(1),(2)
	- 일반화학 및 실험 (1),(2)

**전공기초**

	- 고등미적분학 (1),(2)
	- 대기과학입문

**전공필수**

	- 대기역학 (1)
	- 대기물리 (1),(2)

**전공선택필수**

	- 전자계산 (1) 또는 (2) 택 1 필수
	- 3000-4000 단위 24학점 이상 이수 (2015학번 이후는 대기과학심화연구, 실용기상기후학 4000단위 미포함)

 	※ 캠퍼스 내 복수전공
    	- 전자계산 (1) 또는 (2) 택 1 필수
    	- 3000-4000 단위 15학점 이상 이수 (2015학번 이후는 대기과학심화연구, 실용기상기후학 4000단위 미포함)

	※ 학사편입생 및 졸업예정자 복수전공
		- 3000단위 27학점 이상 이수, 4000단위 6학점 이상(단, 대기과학심화연구, 실용기상기후학 미포함)

**타학과 과목 교차인정(최대 6학점 인정)**

	수학과
	  - 선형대수(1),(2)
	  - 통계학
	  - 수치해석
	  - 편미분방정식
	지구시스템과학과
	  -  위성지구과학및실습
	물리학과
	  - 일반역학(1),(2)
	  - 전자기학(1),(2)
	  - 수리물리(1),(2)
		- 현대물리(1),(2)
	화학과
	  - 분석화학(1),(2)
	  - 환경화학
	생물학과
	  - 환경생물학
<br>

#### (19학번~) 이수조건(단일전공 졸업기준, 일반편입생 동일 적용)
<br>
**필수교양**

	- 미분적분학과 벡터해석 (1),(2)
	- 일반물리학및실험 (1), (2)
	- 일반화학및실험 (1),(2)

**전공기초**

	- 고등미적분학 (1),(2)
	- 일반역학(1)
	- 대기과학입문

**전공필수**

	- 대기역학 (1)
	- 대기물리 (1),(2)
	- 대기열역학
	- 기후역학

**전공선택필수**

	- 전자계산 (1) 또는 (2) 중 택 1 필수
	- 3000, 4000 단위 18학점 이상 (2015학번부터 실용기상기후학 4000단위 미포함)

	※ 캠퍼스 내 복수전공 / 학사편입생 및 졸업예정자 복수전공
		- 전자계산 (1) 또는 (2) 택 1 필수
		- 3000, 4000 단위 9학점 이상 (2015학번부터 실용기상기후학 4000단위 미포함)

**타학과 과목 교차인정(최대 6학점 인정)**

	수학과
	  - 선형대수(1),(2)
	  - 통계학
	  - 수치해석
	  - 편미분방정식
	지구시스템과학과
	  -  위성지구과학및실습
	물리학과
	  - 일반역학(1),(2)
	  - 전자기학(1),(2)
	  - 수리물리(1),(2)
		- 현대물리(1),(2)
	화학과
	  - 분석화학(1),(2)
	  - 환경화학
	생물학과
	  - 환경생물학

**대기과학심화연구 과목 수강조건**

	- 선수과목 5과목을 모두 이수한 경우만 수강가능 (선수과목 이수여부 반드시 확인)
	- 선수과목 : 전자계산(1) 또는 (2), 대기열역학, 대기역학, 대기물리(1), 대기물리(2)

<br>
<br>

## 캠퍼스내 소속변경 조건
----------
#### 캠퍼스내 소속변경 자격 및 학과기준
<br>
	- 2006년 입학자부터 본대학교에서 3학기 이상 수료한 자로서 3학년까지 소속변경 할 수 있음 (연세대학교 소속변경 시행세칙 제2조)
	- 소속변경의 허용범위 및 허용학과는 반드시 학교 홈페이지의 공지사항을 참조
	- 자격 : 소속변경 지원자는 소속변경 지원 전까지 소속학과의 전공과목 중 최소 9학점 이상을 이수하여야 한다. (연세대학교 소속변경 시행세칙 제4조의 1)
	- 이 때, 전공과목 9학점은 '대기과학입문(ATM2105), 기후변화의이해(ATM2101), 대기탐사(ATM2104)'의 세 과목을 반드시 이수하여야 한다.
	- (전공과목 9학점 이상을 이수하였더라도 위 필수 세과목 중 한과목이라도 누락되면 조건미달로 소속변경 불가함.)


<br>
<br>

#### 졸업 조건표 (2010학번~)
-------------------------

<div class='image'>
<img src="../../img/graduation_requirement_table.PNG" class="img-responsive" alt="">
</div>

<br>
   **※본 표는 참고용이며, 졸업요건에 대한 자세한 사항은 학과사무실로 문의 (02-2123-8150)**

   **※09학번 이전 학생들은 학과사무실로 문의 (02-2123-8150)**

<br>
<br>

## 대학원 과정
-------------

#### 석사학위 과정 및 논문 심사 내규 (~ 2019-1학기(전기) 입학생까지 적용)

	제1조 본 내규는 본문 9 항목과 부록1 “연세대학교 대기과학과 석사학위 논문심사절차”로 구성되며, 98-1학기 이후 석사과정 입학생에게 적용된다.

	제2조 석사과정 학생은 학위 취득에 필요한 30학점 중 21학점은 본 학과에서 개설되는 과목으로 취득해야 하며, 나머지 학점은 심사위원회의 승인 하에 타 학과에서 개설되는 과목으로 취득할 수 있다.

	제3조 석사과정 동안 2학기 이상 이수하고 18학점이상을 취득하여야 자격시험에 응시할 수 있다.

	제4조 대기역학Ⅰ, 대기복사Ⅰ, 구름 및 강수과정, 대기분석 과목은 B+이상의 학점을 취득해야 한다. 만일 취득하지 못할 경우 자격시험으로 대체해야 한다.

	제5조 종합시험 합격 결과와 기관 또는 ETS TOEFL 성적 500점 이상, TOEIC성적 650점 이상, TEPS성적 600점 이상의 영어점수를 학위논문 연구계획서 제출 시 함께 제출해야 한다.(대학원 입학시 TOEFL 500점 이상, TOEIC 650점 이상, TEPS 600점 이상인 학생은 해당 사항이 없다.) 단, 산학연에 한해서는 LAT 성적(55점)까지 인정한다.

	제6조 본심사 대상자는 반드시 1회 이상 본인이 주 저자로 전문학회에서 발표한 실적을 제출한다.

	제7조 석사졸업 예정자는 부록1에 첨부된 “연세대학교 대기과학과 석사학위 논문심사절차”를 따른다.

	제8조 최종 학위 논문 인준 시에는 석사학위 논문의 국내 또는 국제 학술지의 논문 투고 또는 게재 증명서를 함께 제출하거나 졸업 후 1년 이내 석사학위 논문 인준을 위한 논문 투고 서약서를 제출하여야 한다.

<br>


#### 박사학위 과정 및 논문 심사 내규 (~ 2019-1학기(전기) 입학생까지 적용)


	제1조 본 내규는 본문 10 항목과 부록2 “연세대학교 대기과학과 박사학위 논문심사절차”로 구성되며, 98-1학기 이후 박사과정 입학생에게 적용된다.

	제2조 박사과정 학생은 박사학위 과정 중에 최소 30 학점을 취득하여야 한다 (대학원 학칙 제 15조). 학위 취득에 필요한 총 60학점 중 30학점을, 석, 박사 통합과정은 54학점 중 30학점을 본 학과에서 개설되는 과목으로 취득해야 하며, 나머지 학점은 심사위원회의 승인 하에 타 학과에서 개설되는 과목으로 취득할 수 있다.

	제3조 논문 심사위원 중 2인까지는 외부 연구기관의 학자로 위촉하여 심사위원회를 구성할 수 있다.

	제4조 박사과정 수료 요건은 4학기 이상의 정규등록을 필한 자로 박사학위과정에서 30학점이상 취득해야 한다.

	제5조 자격시험을 보기 위해서는 박사과정 동안 3학기 이상 이수하고 24학점이상을 취득하여야 한다.

	제6조 자격시험을 보기 위해서는 반드시 그 이전에 전문학회에서 주 저자로 1회 이상 발표하여야 한다. 발표는 박사학위 과정 중 연구한 것에 한한다.

	제7조 논문제안서 심사를 원하는 학생은 박사과정 수료에 필요한 최소 학점을 이수하고(대학원 학칙 제15조), 심사위원회가 정하는 전공과목 중 선택 3과목 및 대기역학1, 구름물리 또는 대기복사1 중 과목 1개를 합격하여야 한다.

	제8조 종합시험 합격 결과와 기관 또는 ETS TOEFL 성적 550점 이상, TOEIC성적 750점 이상, TEPS성적 650점 이상의 영어점수를 학위논문 연구계획서 제출 시 함께 제출해야 한다.(대학원 입학시 TOEFL 550점 이상, TOEIC 750점 이상, TEPS 650점 이상인 학생은 해당 사항이 없다.) 단, 산학연에 한해서는 LAT 성적(60점)까지 인정한다.

	제9조 박사졸업 예정자는 부록2에 첨부된 “연세대학교 대기과학과 박사학위 논문심사절차”를 따른다.

	제10조 본 심사를 받기 위해서는 박사학위 과정에서 수행한 연구결과를 본인이 주 저자로 2편 이상 전공 학술지에 논문으로 게재한 실적이 있어야 하며, 그 중 한편은 국제 SCI 논문 또는 impact factor가 1.5 이상인 SCIE 논문 이어야 한다. 논문은 게재확정 증명서를 받은 상태까지를 인정한다.

<br>
#### 석.박사 통합과정 학위과정
	제1조 석․박사 통합과정 학생은 석사과정 학생과 같이 자격시험을 통과하여야 한다.
	제2조 석사 자격시험을 통과하고, 통합과정 5학기부터 박사과정 학생으로 인정한다.
	제3조 자격시험을 보기 위해서는 42학점이상을 취득하여야 한다.

	* 통합과정 대기과학특론 수강 관련
	-현재와 마찬가지로 통합 5학기부터 박사과정으로 인정 하되, 대기과학특론은 통합 4학기부터 수강 신청 가능함.

<br>

#### 부록1. 석사학위 논문 심사절차

	(1) 논문 심사를 받기 원하는 학기 시작 후 셋째 금요일까지 논문 제출 자격심사 지원 서류를 학과에 제출한다.
	(2) (1)을 통하여 예비심사 대상자를 확정한다.
	(3) 예비심사일정을 통보한다.
	(4) 예비심사일 3주전까지 형식을 완전히 갖춘 학위논문 1부를 학과에 제출한다. 이 때, 논문의 앞장에는 지도교수와 학과장의 서명란을 두며, 지도교수의 서명을 받아 학과에 제출한다. 학과장이 서명한 예비심사 용 논문을 심사위원들에게 제출한다.
	(5) 심사위원 및 학과 교수, 대학원생이 참석한 가운데 예비심사 대상자는 30분간의 공개발표를 실시한다.
	(6) 논문 및 공개발표를 바탕으로 심사위원들이 본심사 대상자를 결정한다.
	(7) 본심사 일정을 발표한다.
	(8) 본심사 3주전까지 형식을 완전히 갖춘 학위논문을 학과에 제출한다. 예비심사와 마찬가지로, 논문의 앞장에는 지도교수와 학과장의 서명란을 두며, 학과에 제출하는 논문은 지도교수의 서명을 받은 논문에 한한다. 학과장의 승인을 받은 후 학과장의 직인이 찍힌 본심사용 논문을 심사위원들에게 제출한다.
	(9) 심사위원 및 학과교수, 대학원생이 참석한 가운데 학위논문심사 대상자는 30분간의 공개 발표를 실시한다.

<br>
#### 부록2. 박사학위 논문 심사절차

	1. 논문 제안서 심사
	(1) 논문 제안서 심사는 논문 예심을 받기 원하는 학기의 적어도 한 학기 전에 시행한다.
	(2) 심사위원장은 논문 제안서 심사일을 정하여 학과와 심사위원들에게 통보한다.
	(3) 심사위원들이 참석한 가운데 심사 대상자는 1시간 동안 논문 제안서 구두 발표를 한다.
	(4) 논문 제안서 및 구두 발표를 바탕으로 논문 제안서 심사를 수행하고 그 결과는 심사위원장이 학과에 통보한다.

	2. 예비심사
	(1) 논문 예비심사를 받기 원하는 학기 시작 후 셋째 주까지 박사학위 논문제출자격심사 지원서를 학과에 제출한다.
	(2) (1)을 통하여 예비심사 대상자를 확정한다.
	(3) 예비심사일정을 통보한다.
	(4) 예비심사일 3주일 전까지 형식을 완전히 갖춘 학위논문 1부를 학과에 제출한다. 이 때, 논문의 앞장에는 지도교수와 학과장의 서명란을 두며, 지도교수의 서명을 받아 학과에 제출한다. 학과장 서명한 예비심사 용 논문을 심사위원들에게 제출한다.
	(5) 심사위원 및 학과 교수, 대학원생이 참석한 가운데 학위논문심사 대상자는 1시간의 공개 발표를 실시한다.
	(6) 논문 및 공개발표를 바탕으로 심사위원들이 예비심사 통과 여부를 결정한다.

	3. 본 심사
	(1) 예비심사 결과를 바탕으로 본심사 대상자를 발표한다. 이 때 본심사 대상자는 박사학위 과정에서 수행한 연구결과를 본인이 주 저자로 2편 이상 전공 학술지에 논문으로 게재한 실적이 있어야 하며, 그 중 한편은 국제 SCI 논문이어야 한다. 논문은 게재확정 증명서를 받은 상태까지를 인정한다.
	(2) 본심사 일정을 발표한다.
	(3) 본 심사 3주일 전까지 형식을 완전히 갖춘 학위논문 1부를 학과에 제출한다. 이 때, 논문의 앞장에는 지도교수와 학과장의 서명란을 두며, 지도교수의 서명을 받아 학과에 제출한다. 학과장이 서명한 본심사용 논문을 심사위원들에게 제출한다.
	(4) 심사위원 및 학과교수, 대학원생이 참석한 가운데 학위논문심사 대상자는 1시간의 공개발표를 실시하며, 그 직후 심사위원만 참석한 가운데 구두시험을 실시한다.
	(5) 논문, 공개발표 및 구두시험을 바탕으로 합격 여부를 결정한다.

<br>
<br>
